src/CF/DocumentJournals/ДокументыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DocumentJournal>
		<Properties>
			<Name>ДокументыКлиента</Name>
			<RegisteredDocuments>
				<xr:Item>Document.ДвиженияДенег</xr:Item>
				<xr:Item>Document.ПоступленияТовара</xr:Item>
				<xr:Item>Document.РасходыТовара</xr:Item>
				<xr:Item>Document.ВыполненияРабот</xr:Item>
				<xr:Item>Document.ОказанияУслугЗаВремя</xr:Item>
				<xr:Item>Document.ОтчетыКомиссионеров</xr:Item>
			</RegisteredDocuments>
		</Properties>
		<ChildObjects>
			<Column>
				<Properties>
					<Name>Клиент</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.КлиентПоставщик</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.КлиентПоставщик</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.КлиентПоставщик</xr:Item>
						<xr:Item>Document.ВыполненияРабот.Attribute.Клиент</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.Клиент</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.Клиент</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Аналитика</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.Статья</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Склад</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Склад</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.Номенклатура</xr:Item>
						<xr:Item>Document.ВыполненияРабот.Attribute.Номенклатура</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.ОбщийПроцентКомиссионногоВознаграждения</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Договор</Name>
					<References>
						<xr:Item>Document.РасходыТовара.Attribute.Договор</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Договор</xr:Item>
						<xr:Item>Document.ДвиженияДенег.Attribute.Договор</xr:Item>
						<xr:Item>Document.ВыполненияРабот.Attribute.Договор</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.Договор</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.Договор</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Количество</Name>
					<References>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.ТовараВКоличестве</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.ТовараВКоличестве</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ТовараВКоличестве</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.ТовараВКоличестве</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Организация</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.Организация</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Организация</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Организация</xr:Item>
						<xr:Item>Document.ВыполненияРабот.Attribute.Организация</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.Организация</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>СтоимостьТовара</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.ТовараНаСумму</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ТовараНаСумму</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.ТовараНаСумму</xr:Item>
						<xr:Item>Document.ДвиженияДенег.Attribute.Сумма</xr:Item>
						<xr:Item>Document.ВыполненияРабот.Attribute.Результат</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.ТовараНаСумму</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сумма</Name>
					<References>
						<xr:Item>Document.ДвиженияДенег.Attribute.Сумма</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.ВыбылоДенег</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ПоступилоДенег</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.ПоступилоДенег</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.ТовараНаСумму</xr:Item>
						<xr:Item>Document.ВыполненияРабот.Attribute.ПоступилоДенег</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Комментарий</Name>
					<References>
						<xr:Item>Document.ВыполненияРабот.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ДвиженияДенег.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Комментарий</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.Комментарий</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>Сторный</Name>
					<References>
						<xr:Item>Document.ПоступленияТовара.Attribute.Сторный</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.Сторный</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.Сторный</xr:Item>
						<xr:Item>Document.ОказанияУслугЗаВремя.Attribute.Сторный</xr:Item>
						<xr:Item>Document.ДвиженияДенег.Attribute.Сторный</xr:Item>
						<xr:Item>Document.ВыполненияРабот.Attribute.Сторный</xr:Item>
					</References>
				</Properties>
			</Column>
			<Column>
				<Properties>
					<Name>ПроТовары</Name>
					<References>
						<xr:Item>Document.ВыполненияРабот.Attribute.ПроТовары</xr:Item>
						<xr:Item>Document.ПоступленияТовара.Attribute.ПроТовары</xr:Item>
						<xr:Item>Document.РасходыТовара.Attribute.ПроТовары</xr:Item>
						<xr:Item>Document.ОтчетыКомиссионеров.Attribute.ПроТовары</xr:Item>
					</References>
				</Properties>
			</Column>
		</ChildObjects>
	</DocumentJournal>
</MetaDataObject>

src/CF/DocumentJournals/ДокументыКлиента/Forms/ФормаСписка/Ext/Form/Module.bsl
// sza151210-2355 про
// sza140606-0044
// sza130909-0324 :

&НаКлиенте
Процедура ОтборПоКлиентуОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)

	ОбщийМодульКлиент.ПоискОшибкиПриВводеТекстаПользователем("Клиенты", ДанныеВыбора, Текст, ОтборПоКлиенту);
	ОтборПоКлиентуПриИзмененииНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоКлиентуПриИзменении(Элемент)

	ОтборПоКлиентуПриИзмененииНаСервере();

КонецПроцедуры

Процедура ОтборПоКлиентуПриИзмененииНаСервере()

	список.Параметры.УстановитьЗначениеПараметра("Клиент", ОтборПоКлиенту);
	список.Параметры.УстановитьЗначениеПараметра("Организация", ОтборПоОрганизации);
	список.Параметры.УстановитьЗначениеПараметра("НеИспользоватьОтборПоОрганизации", НЕ ОбщийМодульПовтор.ПолучитьПараметрСеанса("ВестиУчетСобственныхЮридическихЛицПС") ИЛИ НЕ ЗначениеЗаполнено(ОтборПоОрганизации));

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоОрганизацииПриИзменении(Элемент)
	ОтборПоКлиентуПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция   ПолучитьКлиентаПоУмолчанию()

	РезультатПолучитьКлиентаПоУмолчанию = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("КлиентПоУмолчанию");

	Возврат РезультатПолучитьКлиентаПоУмолчанию;

КонецФункции // ПолучитьКлиентаПоУмолчанию

&НаКлиенте
Процедура ПослеИзображенияОкнаФормы() // Когда окно уже нарисовано пользователю
	ЭтаФорма.Элементы.ФормаЗакрыть.Видимость = НЕ ЭтаФорма.Окно = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()                                                 // ПРИ ЗАКРЫТИИ
	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 1);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)                                            // ПРИ ОТКРЫТИИ

	Если ЗначениеЗаполнено(Параметры.Клиент) Тогда
		ОтборПоКлиенту = Параметры.Клиент;
	КонецЕсли;

	ОбщийМодульКлиент.СобытиеФормы(ЭтаФорма, 0);

	Если НЕ ЗначениеЗаполнено(ОтборПоКлиенту) Тогда
		ОтборПоКлиенту = ПолучитьКлиентаПоУмолчанию();
	КонецЕсли;

	ОтборПоКлиентуПриИзмененииНаСервере();
	ПодключитьОбработчикОжидания("ПослеИзображенияОкнаФормы", 0.3, ИСТИНА);

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Отказ = ОбщийМодульСервисСервер.ПроверитьОтказДоступа("000607", ЭтаФорма, Отказ, );

	Если НЕ Отказ Тогда
		Если ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ИспользоватьСобственныйПереводЭлементовИнтерфейса") Тогда
			ОбщийМодульСервер.ПеревестиРеквизитыФормы(ЭтаФорма);
		КонецЕсли;

		ОбщийМодульСервисСервер.ОформитьФорматКоличества(Элементы.Количество, , ИСТИНА);
		ОбщийМодульСервер.ОбеспечитьСписокОтборов(Список);
		ОтборПоКлиентуПриИзмененииНаСервере();
		Элементы.ПроТовары.Видимость = ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("ФормироватьОписаниеТаблицОбъектовДляИхСписков");
	КонецЕсли;

	ОбщийМодульСервисСервер.ОбработатьНовуюФорму(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы) Экспорт // Для реакции на события для запрограммированных элементов
	ОбщийМодульКлиент.РеакцияНаПрочиеСобытияФормы(КомандаСобытияФормы, ЭтаФорма);
КонецПроцедуры
